export default {
    getProjectById
}

// https://youtu.be/

   const quiz4fun= {
        subtitle: 'אפליקציה ליצירת חידונים',
            title: 'Quiz4Fun',
            text: 'הרעיון נולד מבקשה של יהב בתי בת ה6, לבנות לה אפליקציה ללמוד תנ"ך\n' +
        "זה התחבר לי עם הכובע הקודם שחבשתי,\n" +
        " כבעל עסק המתמקד בחינוך והעשרה " +
        "וכסטודנט לחינוך\n\n" +
        "אהבתי את הרעיון," +
        " אבל החלטתי להפוך אותו לג'נרי \n" +
        "מערכת ליצירת חידונים\n" +
        "בה, כל אחד יוכל להכניס נתונים, ולקבל חידון מגניב\n" +
        "ולשלוח קישור לחברים" ,
            technology: "מה למדתי מהפרוייקט? \n" +
        "הפרוייקט לימד אותי לעבוד עם הפריימוורק vue.js על מנת לבנות את הצד לקוח \n" +
        "עם vuetify על מנת לעצב את האפליקציה לפי העקרונות של material-design\n" +
        "למדתי ויישמתי את המשמעות של כתיבת קוד מודולרי וג'נרי\n" +
        "בדאטה בייס השתמשתי realtime database של firebase\n" +
        "ועל מנת לבצע מניפולציות על הדאטה בצד שרת, השתמשתי בcloud-functions\n" ,
            pics: ['vue.png','vuetify.webp', 'firebase.png'],
            appPic:['quiz4fun.jpeg'],
       video:'tz71Chrslkc',
       noVideo:false
}
const calculator= {
    subtitle: 'מתנת פרידה לחברים שלי \n' +
        'פותרת כאב שהיה לי בתור בעל עסק',
    title: 'מחשבון האביזרים הנלווים',
    text: 'להיות זכיין שמנהל אזור בחברת חוגים זה לא דבר פשוט \n' +
        "הרבה אחריות מוטלת לך על הכתפיים,\n" +
        "עניינים כמו כוח אדם, הדרכה,שיווק ומכירות\n" +
        "ניהול עסק מבחינה עיסקית וחשבונאית \n" +
        "אחד הדברים שהקשו עליי הוא נושא הלוגיסטיקה\n\n" +
        "ניסיתי למצוא פתרון לבעיה,\n" +
        " שצריך לחלק המון ברגים קטנים לכל ילד, כשיש לך באזור 500 ילדים \n" +
        "כי ביננו, זה לא הגיוני לספור ברגים אחד אחד\n" +
        "וגם אם אנחנו הולכים לשקול אותם\n" +
        "קשה כל פעם לחשב, מה המשקל המדויק הנדרש\n" +
        "וכך נולדה לה האפליקציה הזאת\n" +
        "ששומרת את הנתונים, ומחשבת באופן אוטומטי" ,
    technology: "מה למדתי מהפרוייקט? \n" +
        "הפרוייקט מבחינה טכנולוגית דומה לאפליקציית החידונים \n" +
        "מה שעזר לי להבין יותר לעומק ולשפר יכולות ב- vue.js ו- vuetify ו-firebase\n" +
        "לפני כתיבת הפרוייקט נכנסתי לבידוד, והתמודדתי עם כתיבת קוד לבד\n" +
        "ומתוך כך פתרון בעיות ולמידה עצמית \n" +
        "הפרוייקט חיזק אצלי את תחושת הביטחון, שאני יכול לבנות אפליקציות בזריזות\n" +
        "(תוך יומיים במקרה הזה)\n" +
        "ופתח לי את הרעב ליצור עוד דברים לעצמי ובעצמי\n" ,
    pics: ['vue.png','vuetify.webp', 'firebase.png'],
    appPic:['calculator.jpeg'],
    video:'rn6GNeiIjw4',
    noVideo:false
}
const bullshot= {
    subtitle: 'פרוייקט מדהים שלקחתי בו חלק \n',
    title: 'bullshot',
    text: 'אחת הדרכים הנהדרות לשווק עסק היא בוידאו \n' +
        "וכשמי שמצטלם בוידאו, הוא לקוח שממליץ,\n" +
        "זה שילוב מנצח\n" +
        "וזו בעיניי המהות של בולשוט \n" +
        "אפליקציה שעוזרת לגבות עדות לקוח בשלט רחוק\n\n" +
        "אפליקציה זו נבנתה על ידי צוות קודם\n" +
        "התפקיד שלי היה להכנס לתוך הקוד ולערוך בו שינויים \n" +
        "להוסיף פיצ'רים ולתקן באגים\n",
    technology: "מה למדתי מהפרוייקט? \n" +
        "מבחינת טכנולוגיות, הייתי צריך להכנס לקוד שנכתב בvuex \n" +
        "טכנולוגיה שמשפרת את היכולת לנהל state\n" +
        "כמו כן, הקוד נכתב ללא שימוש בvuetify\n" +
        "מה שדרש ממני לצאת מאיזור הנוחות ולהעמיק בCSS\n" +
        "בעבודה על הדאטה-בייס, למדתי לעבוד עם firestore ו-storage" +
        "הפקתי תועלת וניסיון מעצם הכניסה והתעמקות בקוד של מפתח אחר\n" +
        "זו יכולת חשובה בעיניי, מתוך הנחה שאצטרך לעשות זאת עוד בעתיד",
    pics: ['vuex.png','css3.png', 'firebase.png'],
    appPic:['calculator.jpeg'],
    video:'HWUrW1Ag-xE',
    noVideo:false
}
const games= {
    subtitle: 'מוגשת בהמון אהבה \n',
    title: 'achiya-games',
    text: 'בחלק השני של הקורס, חשתי בחיסרון \n' +
        "התחלתי לעבוד על קוד שצוות אחר כתב,\n" +
        "ונמנעה ממני, חדוות היצירה\n" +
        "כדי להמשיך ליצור ומתוך תשוקה לכתיבת קוד \n" +
        "התחלתי לפתח את המשחקים\n\n" +
        "בהתחלה איקס עיגול\n" +
        "ואז.. הוספתי והוספתי \n" +
        "וזה מה שהספקתי עד עכשיו\n" +
        "נהניתי להפעיל את הראש, ולהפוך לוגיקה טהורה\n" +
        "למשחק שרץ על הצג",
    technology: "מה למדתי מהפרוייקט? \n" +
        "בעיקר js \n" +
        "האפליקציה אמנם עטופה במסגרת שלvue.js\n" +
        "אבל היא בעיקר לימדה אותי עוד מסודותיה של אמא של vue\n" +
        "כמו כן על מנת לפתור עיניינים בגרפיקה\n" +
        "הייתי צריך להעמיק עוד בCSS\n" +
        "ניתן לראות את ההתפתחות שעברתי גם בסרטון\n" +
        "מה שלא רואים בסרטוןזה שמפרויקט לפרויקט,\n" +
        "השתדלתי לכתוב קוד יותר איכותי, ג'נרי ומודולרי" ,
    pics: ['js.png','css3.png', 'vue.png'],
    appPic:['tetris.png'],
    video:'XsQaUY88CaE',
    noVideo:false
}
const rpgyzer= {
    subtitle: 'טבילת האש שלי בצד שרת \n',
    title: 'RPGYZER',
    text: 'אומרים שאמזון עושה את הסוחרים שלה עשירים \n' +
        "אך המתכנתים שעובדים איתם את שערותיהם משירים,\n\n" +
        "RPGYZER היא תוכנה שאני מפתח כפרילנסר עבור RPGECOM\n" +
        "חברה המתמחה במסחר באמזון והשקעות בתחום\n" +
        "בזמן שאני כותב את השורות האלה, אני באמצע הפרוייקט\n" +
        "שככל הנראה ובעזרת ה'\n" +
        "יהפוך להיות פרוייקט גדול ומשמעותי\n" +
        "שישפיע על אנשים רבים\n" +
        "(מה שסביר שיקרה כי החברה האלה מכוונים גבוה)\n" +
        "ובמילים אחרות- 'עוד תשמעו עלינו!'" ,
    technology: "מה למדתי מהפרוייקט? \n" +
        "בינתיים למדתי מספר דברים מעניינים \n" +
        "התעמקתי בnode.js ובrest-api\n" +
        "מימשתי דברים מגניבים כמו OAuth 2\n" +
        "ובעיקר אותגרתי מלשבור את הראש על דוקומנטציה בלתי קריאה בעליל\n" +
        "חיזק אצלי את תחושת היכולת לעשות הכל ולעמוד באתגר" ,
    pics: ['nodejs.png','oauth.png', 'rest.png'],
    noVideo:true
}
const portfolio= {
    subtitle: 'אשר אני מתרגש להציג בפניכם ברגע זה \n',
    title: 'תיק העבודות שלי',
    text: "פרוייקט זה נבנה על פי שיטת המצוינות\n" +
        "שאת הפרטים עליה תמצאו \n" +
        "אם תגללו עוד למטה לפרטים עליי\n\n" +
        "תודה רבה שהגעתם עד לכאן\n" +
        "מי שכלכך מגניב וקורא את השורות האלה\nשישלח לי אימוג'י של כיף\n" +
        "מקווה שנהנתם!" ,
    technology: "מה למדתי מהפרוייקט? \n" +
        "דבר או שניים על רספונסיביות \n" +
        "התעמקתי בcss ובvuetify\n" +
        "תמיד טוב לכתוב קוד חדש בvue.js" ,
    pics: ['css3.png','vuetify.webp'],
    noVideo:true
}

const projectArray = [quiz4fun,calculator,games,bullshot,rpgyzer,portfolio]

function getProjectById(i){
    return projectArray[i]
}
